
&НаКлиенте
Процедура Обновить(Команда)
	ОбщегоНазначенияКлиентСервер.УстановитьОтборДинамическогоСписка(Журнал, "Замер", Замер);
	
//	Если ЗначениеЗаполнено(Период.ДатаНачала) Тогда
//		ОбщегоНазначенияКлиентСервер.УстановитьОтборДинамическогоСписка(Журнал, "ПериодСобытия", Период.ДатаНачала, ВидСравненияКомпоновкиДанных.БольшеИлиРавно);
//	КонецЕсли;	
//	Если ЗначениеЗаполнено(Период.ДатаОкончания) Тогда
//		ОбщегоНазначенияКлиентСервер.УстановитьОтборДинамическогоСписка(Журнал, "ПериодСобытия", Период.ДатаОкончания, ВидСравненияКомпоновкиДанных.МеньшеИлиРавно);
//	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЖурналПриАктивизацииСтроки(Элемент)
	Если Элементы.Журнал.ТекущиеДанные <> Неопределено Тогда
		КлючСобытия= Элементы.Журнал.ТекущиеДанные.КлючСобытия;
	
		ОбщегоНазначенияКлиентСервер.УстановитьОтборДинамическогоСписка(Сойства, "КлючСобытия", КлючСобытия);
	КонецЕсли;
КонецПроцедуры




