
&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьЖурналНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТЗЖурналПриАктивизацииСтроки(Элемент)
	Если Элементы.ТЗЖурнал.ТекущиеДанные <> Неопределено Тогда
		КлючСобытия= Элементы.ТЗЖурнал.ТекущиеДанные.КлючСобытия;
	
		ОбновитьСвойстваНаСервере(КлючСобытия);
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ОбновитьЖурналНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Журнал.ПериодСобытия,
		|	Журнал.ДоляПериода,
		|	Журнал.Событие,
		|	Журнал.КлючСобытия,
		|	Журнал.Длительность,
		|	Журнал.Уровень,
		|	Журнал.ДлительностьСек
		|ИЗ
		|	РегистрСведений.Журнал КАК Журнал
		|ГДЕ
		|	Журнал.Замер = &Замер
		|	И Журнал.ПериодСобытия МЕЖДУ &Дата1 И &Дата2";
	
	Запрос.УстановитьПараметр("Замер", Замер);
	Запрос.УстановитьПараметр("Дата1", Период.ДатаНачала);
	Запрос.УстановитьПараметр("Дата2", Период.ДатаОкончания);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗЖурнал.Загрузить(РезультатЗапроса.Выгрузить());

КонецПроцедуры
&НаСервере
Процедура ОбновитьСвойстваНаСервере(КлючСобытия)
	Если Не ЗначениеЗаполнено(КлючСобытия) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СвойстваСобытия.КлючСобытия,
		|	СвойстваСобытия.Свойство,
		|	СвойстваСобытия.ЗначениеСвойства как Значение
		|ИЗ
		|	РегистрСведений.СвойстваСобытия КАК СвойстваСобытия
		|ГДЕ
		|	СвойстваСобытия.КлючСобытия = &КлючСобытия
		|	И СвойстваСобытия.Замер = &Замер";
	
	Запрос.УстановитьПараметр("Замер", Замер);
	Запрос.УстановитьПараметр("КлючСобытия", КлючСобытия);
	
	РезультатЗапроса = Запрос.Выполнить();

	ТЗСвойства.Загрузить(РезультатЗапроса.Выгрузить());
КонецПроцедуры