Процедура УстановитьОтборДинамическогоСписка(Список, ПолеОтбора, Значение, ВидСравнения=Неопределено) экспорт
	Если Не ЗначениеЗаполнено(ВидСравнения) Тогда
		ВидСравнения= ВидСравненияКомпоновкиДанных.Равно;
	КонецЕсли;
	
	Отбор = Список.КомпоновщикНастроек.Настройки.Отбор.Элементы;
	Отбор.Очистить();

	УсловиеОтбора = Отбор.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	УсловиеОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПолеОтбора);
	УсловиеОтбора.ВидСравнения = ВидСравнения;
	УсловиеОтбора.ПравоеЗначение = Значение;

	Список.КомпоновщикНастроек.ЗагрузитьНастройки(Список.КомпоновщикНастроек.Настройки);
КонецПроцедуры