
#Область СлужебныеПроцедурыИФункции


Процедура ЗаполнитьДеревоМД(БазаДанных) Экспорт
	
	
	ДобавитьКлассМД(БазаДанных, "Планы обмена", Метаданные.ПланыОбмена, БиблиотекаКартинок.ПланОбмена);
	ДобавитьКлассМД(БазаДанных, "Константы", Метаданные.Константы, БиблиотекаКартинок.Константа);
	ДобавитьКлассМД(БазаДанных, "Справочники", Метаданные.Справочники, БиблиотекаКартинок.Справочник);
	ДобавитьКлассМД(БазаДанных, "Документы", Метаданные.Документы, БиблиотекаКартинок.Документ);
	ДобавитьКлассМД(БазаДанных, "Журналы документов", Метаданные.ЖурналыДокументов, БиблиотекаКартинок.ЖурналДокументов);
	ДобавитьКлассМД(БазаДанных, "Перечисления", Метаданные.Перечисления, БиблиотекаКартинок.Перечисление);
	ДобавитьКлассМД(БазаДанных, "Планы видов характеристик", Метаданные.ПланыВидовХарактеристик, БиблиотекаКартинок.ПланВидовХарактеристик);
	ДобавитьКлассМД(БазаДанных, "Планы счетов", Метаданные.ПланыСчетов, БиблиотекаКартинок.ПланСчетов);
	ДобавитьКлассМД(БазаДанных, "Планы видов расчета", Метаданные.ПланыВидовРасчета, БиблиотекаКартинок.ПланВидовРасчета);
	ДобавитьКлассМД(БазаДанных, "Регистры сведений", Метаданные.РегистрыСведений, БиблиотекаКартинок.РегистрСведений);
	ДобавитьКлассМД(БазаДанных, "Регистры накопления", Метаданные.РегистрыНакопления, БиблиотекаКартинок.РегистрНакопления);
	ДобавитьКлассМД(БазаДанных, "Регистры бухгалтерии", Метаданные.РегистрыБухгалтерии, БиблиотекаКартинок.РегистрБухгалтерии);
	ДобавитьКлассМД(БазаДанных, "Регистры расчета", Метаданные.РегистрыРасчета, БиблиотекаКартинок.РегистрРасчета);
	ДобавитьКлассМД(БазаДанных, "Бизнес-процессы", Метаданные.БизнесПроцессы, БиблиотекаКартинок.БизнесПроцесс);
	ДобавитьКлассМД(БазаДанных, "Задачи", Метаданные.Задачи, БиблиотекаКартинок.Задача);
	ДобавитьКлассМД(БазаДанных, "Внешние источники данных", Метаданные.ВнешниеИсточникиДанных, БиблиотекаКартинок.ВнешнийИсточникДанных);
	

КонецПроцедуры

Процедура ДобавитьКлассМД(БазаДанных, ИмяРаздела, КлассМД, ИконкаПодчиненного)

	Раздел= Справочники.Методанные1С.НайтиПоНаименованию(ИмяРаздела, Истина, , БазаДанных);
	Если Не ЗначениеЗаполнено(Раздел) Тогда
		НовыйРаздел= Справочники.Методанные1С.СоздатьГруппу();
		НовыйРаздел.Наименование= ИмяРаздела;
		НовыйРаздел.Владелец= БазаДанных;
		НовыйРаздел.Записать();
		Раздел= Раздел.Ссылка;
	КонецЕсли;

	Для Каждого ОбъектМД Из КлассМД Цикл
		Элемент= Справочники.Методанные1С.НайтиПоНаименованию(ИмяРаздела, Истина, Раздел, БазаДанных);
		Если Не ЗначениеЗаполнено(Элемент) Тогда
			НовыйЭлемент= Справочники.Методанные1С.СоздатьЭлемент();
			НовыйЭлемент.Владелец= БазаДанных;
			НовыйЭлемент.Наименование= ОбъектМД.ПолноеИмя();
			НовыйЭлемент.Синоним= ?(ОбъектМД.Синоним = "", ОбъектМД.Имя, ОбъектМД.Синоним);
			НовыйЭлемент.Записать();
			Элемент= НовыйЭлемент.Ссылка;
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры


#КонецОбласти

