
&НаКлиенте
Процедура ВыбратьФайл(Команда)
	Диалог= Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр="Файл технологического журнала (*.log)|*.log";

	ОповещениеЗавершения = Новый ОписаниеОповещения("ВыборФайлаЗавершение", ЭтаФорма);
	Диалог.Показать(ОповещениеЗавершения);
КонецПроцедуры
&НаКлиенте
Процедура ВыборФайлаЗавершение(Результат, ДопПараметр) Экспорт
	Если ЗначениеЗаполнено(Результат) И Результат.Количество() Тогда
		ФайлТЖ= Результат[0];
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьТЖ(Команда)
	ПрочитатьТЖНаСервере();
КонецПроцедуры
&НаСервере
Процедура ПрочитатьТЖНаСервере()
	ТЖСервер.ПрочитатьТЖ(ФайлТЖ, Замер);
КонецПроцедуры
