
&НаКлиенте
Процедура УдалитьСтруктуру(Команда)
	УдалитьСтруктуруНаСервере();
КонецПроцедуры

&НаСервере
Процедура УдалитьСтруктуруНаСервере()
	СтруктураДанныхСервер.УдалитьСтруктуруНаСервере(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСтруктуруБД(Команда)
	Если ЭтаФорма.Модифицированность Тогда
		Сообщить("Сначала запишите данные");
	Иначе
		ЗаполнитьСтруктуруБДНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтруктуруБДНаСервере()
	
	СтруктураДанныхСервер.УдалитьСтруктуруНаСервере(Ложь);
			
	СтруктураДанныхСервер.ЗаполнитьДеревоМД(Объект.Ссылка);
	
	СтруктураХраненияБазыДанных = ПолучитьСтруктуруХраненияБазыДанных(); 
	Для Каждого СтрокаХраненияБД Из СтруктураХраненияБазыДанных Цикл
		
//		НоваяСтрока = СтруктураБазыДанных.Добавить();	
//		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаХраненияБД, "ИмяТаблицыХранения,ИмяТаблицы,Метаданные,Назначение");		
//		
//		Для Каждого СтрокаПоляБД Из СтрокаХраненияБД.Поля Цикл
//			 СтрокаПолей = НоваяСтрока.Поля.Добавить();
//			 ЗаполнитьЗначенияСвойств(СтрокаПолей, СтрокаПоляБД);
//		КонецЦикла;
//		
//		Для Каждого СтрокаИндекса Из СтрокаХраненияБД.Индексы Цикл			
//			 УзелИндекса = НоваяСтрока._Индексы.ПолучитьЭлементы().Добавить();
//			 УзелИндекса.ИмяПоляХранения = СтрокаИндекса.ИмяИндексаХранения;	 
//			 Для Каждого СтрокаПолейИндекса Из СтрокаИндекса.Поля Цикл	 
//				 УзелПоляИндекса = УзелИндекса.ПолучитьЭлементы().Добавить();
//				 ЗаполнитьЗначенияСвойств(УзелПоляИндекса, СтрокаПолейИндекса, "ИмяПоляХранения,ИмяПоля,Метаданные"); 
//			 КонецЦикла;
//		КонецЦикла;
//		
	КонецЦикла;
 
КонецПроцедуры
