&НаКлиенте
Процедура УдалитьСтруктуру(Команда)
	УдалитьСтруктуруНаСервере();
КонецПроцедуры

&НаСервере
Процедура УдалитьСтруктуруНаСервере()
	СтруктураДанныхСервер.УдалитьСтруктуруНаСервере(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСтруктуруБД(Команда)
	Если ЭтаФорма.Модифицированность Тогда
		Сообщить("Сначала запишите данные");
	Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(ПутьКФайлу) Тогда
		Сообщить("Выберите файл со структурой");
		Возврат;
	КонецЕсли;
		
	//Текст= Новый ТекстовыйДокумент;
	ОповещениеЗавершения = Новый ОписаниеОповещения("ЧтениеФайлаЗавершение", ЭтотОбъект);
	Текст.НачатьЧтение(ОповещениеЗавершения, ПутьКФайлу, КодировкаТекста.UTF8);

КонецПроцедуры
&НаКлиенте
Процедура ЧтениеФайлаЗавершение(Результат) Экспорт
		стрДанныеБД= Текст.ПолучитьТекст();

		Адрес= ПоместитьВоВременноеХранилище(стрДанныеБД, УникальныйИдентификатор);

		ЗаполнитьСтруктуруБДНаСервере(Адрес);
КонецПроцедуры
&НаСервере
Процедура ЗаполнитьСтруктуруБДНаСервере(Адрес)

	СтруктураДанныхСервер.УдалитьСтруктуруНаСервере(Ложь, Объект.Ссылка);
	
	стрДанныеБД= ПолучитьИзВременногоХранилища(Адрес);

	ТаблицыХраненияМетаданных= ЗначениеИзСтрокиВнутр(стрДанныеБД);
	
	СтруктураДанныхСервер.ЗаполнитьСтруктуруБДНаСервере(ТаблицыХраненияМетаданных, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайлСтруктуры(Команда)
	Диалог= Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр="Файл структуры БД (*.txt)|*.txt";

	ОповещениеЗавершения = Новый ОписаниеОповещения("ВыборФайлаЗавершение", ЭтотОбъект);
	Диалог.Показать(ОповещениеЗавершения);
КонецПроцедуры
&НаКлиенте
Процедура ВыборФайлаЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт

	Если ВыбранныеФайлы <> Неопределено Тогда

		ПутьКФайлу = ВыбранныеФайлы[0];

	КонецЕсли;

КонецПроцедуры
