
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		Элементы.ТЗПлана.Видимость= Ложь;
	Элементы.Текст1С.Видимость= Ложь;
КонецПроцедуры

&НаКлиенте
Процедура Разобрать(Команда)
	РазобратьНаСервере();
КонецПроцедуры
&НаСервере
Процедура РазобратьНаСервере()
	Элементы.ТЗПлана.Видимость= Ложь;
	Элементы.Текст1С.Видимость= Истина;
	
	Текст1С.Очистить();
	
	мВысотаТабличногоДокумента = ТекстSQL.ВысотаТаблицы;
	Колонка= 1;
	
	Для Строка = 1 По мВысотаТабличногоДокумента Цикл
		мСодержание = ТекстSQL.Область("R" + Формат(Строка,"ЧГ=") + "C" + Формат(Колонка,"ЧГ=")).Текст;
		
		Текст= РазборЗапросаСервер.РазобратьПланЗапроса(мСодержание, БазаДанных);
		
		Текст1С.Область("R" + Формат(Строка,"ЧГ=") + "C" + Формат(Колонка,"ЧГ=")).Текст= Текст;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Преобразовать(Команда)
	ПреобразоватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПреобразоватьНаСервере()
	Элементы.ТЗПлана.Видимость= Истина;
	Элементы.Текст1С.Видимость= Ложь;
	
	Текст1С.Очистить();
	ТЗПлана.Очистить();

	ВысотаТабличногоДокумента = ТекстSQL.ВысотаТаблицы;
	Колонка= 1;
	
	Строка= 1;
	Заголовки = ТекстSQL.Область("R" + Формат(Строка,"ЧГ=") + "C" + Формат(Колонка,"ЧГ=")).Текст;
	мЗаголовков= РазборЗапросаСервер.ПолучитьРазбивку(Заголовки);		
	
	Для Строка = 3 По ВысотаТабличногоДокумента Цикл
		Содержание = ТекстSQL.Область("R" + Формат(Строка,"ЧГ=") + "C" + Формат(Колонка,"ЧГ=")).Текст;

		НоваяСтрока= ТЗПлана.Добавить();		
		Для Инд=0 По мЗаголовков.Количество()-1 Цикл
			ОписаниеЗаголовка= мЗаголовков[Инд];
			Заголовок= ОписаниеЗаголовка.Заголовок;
			Начало= ОписаниеЗаголовка.Начало;
			
			Если Инд = мЗаголовков.Количество()-1 Тогда
				НачалоСлед= Начало+СтрДлина(Заголовок);
			Иначе 
				НачалоСлед= мЗаголовков[Инд+1].Начало;
			КонецЕсли;
			
			Текст= СокрЛП(Сред(Содержание, Начало, НачалоСлед-Начало));
			
			Если Заголовок = "StmtText" Тогда
				Текст= РазборЗапросаСервер.РазобратьПланЗапроса(Текст, БазаДанных);
			КонецЕсли;
			
			НоваяСтрока[Заголовок]= Текст;
			
			//КолонкаИсх= Инд+1;
			//Текст1С.Область("R" + Формат(Строка,"ЧГ=") + "C" + Формат(КолонкаИсх,"ЧГ=")).Текст= Текст;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры





