
&НаКлиенте
Процедура Разобрать(Команда)
	РазобратьНаСервере();
КонецПроцедуры
&НаСервере
Процедура РазобратьНаСервере()
	Текст1С.Очистить();
	
	мВысотаТабличногоДокумента = ТекстSQL.ВысотаТаблицы;
	Колонка= 1;
	
	Для Строка = 1 По мВысотаТабличногоДокумента Цикл
		мСодержание = ТекстSQL.Область("R" + Формат(Строка,"ЧГ=") + "C" + Формат(Колонка,"ЧГ=")).Текст;
		
		Текст= РазборЗапросаСервер.РазобратьПланЗапроса(мСодержание, БазаДанных);
		
		
		
		Текст1С.Область("R" + Формат(Строка,"ЧГ=") + "C" + Формат(Колонка,"ЧГ=")).Текст= Текст;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Преобразовать(Команда)
	ПреобразоватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПреобразоватьНаСервере()
	Текст1С.Очистить();
	
	ВысотаТабличногоДокумента = ТекстSQL.ВысотаТаблицы;
	Колонка= 1;
	
	Строка= 1;
	Заголовки = ТекстSQL.Область("R" + Формат(Строка,"ЧГ=") + "C" + Формат(Колонка,"ЧГ=")).Текст;
	мЗаголовков= РазборЗапросаСервер.ПолучитьРазбивку(Заголовки);		
	
	Для Строка = 1 По ВысотаТабличногоДокумента Цикл
		Содержание = ТекстSQL.Область("R" + Формат(Строка,"ЧГ=") + "C" + Формат(Колонка,"ЧГ=")).Текст;
		
		Для Инд=0 По мЗаголовков.Количество()-1 Цикл
			ОписаниеЗаголовка= мЗаголовков[Инд];
			Если Инд = мЗаголовков.Количество()-1 Тогда
				НачалоСлед= ОписаниеЗаголовка.Начало+СтрДлина(ОписаниеЗаголовка.Заголовок);
			Иначе 
				НачалоСлед= мЗаголовков[Инд+1].Начало;
			КонецЕсли;
			
			Текст= СокрЛП(Сред(Содержание, ОписаниеЗаголовка.Начало, НачалоСлед-ОписаниеЗаголовка.Начало));
		
			КолонкаИсх= Инд+1;
			Текст1С.Область("R" + Формат(Строка,"ЧГ=") + "C" + Формат(КолонкаИсх,"ЧГ=")).Текст= Текст;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

//		ТЗЗаголовки.Колонки.Добавить("Заголовок", Новый ОписаниеТипов(Тип("Строка"), , , , , , ));

